# Sampling Techniques:

. Sampling techniques from the foundation of statiatical analysis and research methodologies.
. These techniques provides the systematic ways to select a subset(sample) from a larger group (population) for analysis.
. By working with a sample researchers can infer characteristics about the entire population without the need to study every individual or item, which may be
impractical due to constraint like time,cost and feasibility.
## 1. Simple Random Sampling:
- ** Description ** : selects items randomly, ensuring each has an equal chance of being chosen.
- ** Methods used ** :
1. np.choose: selects random indices from sampling.
2. dataframe.sample: randomly picking rows form the dataset.
- ** Strengths ** : Highly unbaised and representative.
- ** Limitations ** : Doesnt gurantee subgroups representation and require complete list of population.|

In [2]:
import seaborn as sns
import pandas as pd
import numpy as np

In [3]:
titanic=sns.load_dataset("titanic")

In [4]:
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df=titanic[['sex','age','fare']]

In [6]:
df

        sex   age     fare
0      male  22.0   7.2500
1    female  38.0  71.2833
2    female  26.0   7.9250
3    female  35.0  53.1000
4      male  35.0   8.0500
..      ...   ...      ...
886    male  27.0  13.0000
887  female  19.0  30.0000
888  female   NaN  23.4500
889    male  26.0  30.0000
890    male  32.0   7.7500

[891 rows x 3 columns]

In [7]:
n_sample=10

random_indices=np.random.choice(df.index,size=n_sample,replace=False)
random_indices

array([ 89, 784, 829, 420, 874, 418, 295, 510, 288, 362])

In [8]:
sample_np=df.loc[random_indices]
sample_np

        sex   age     fare
89     male  24.0   8.0500
784    male  25.0   7.0500
829  female  62.0  80.0000
420    male   NaN   7.8958
874  female  28.0  24.0000
418    male  30.0  13.0000
295    male   NaN  27.7208
510    male  29.0   7.7500
288    male  42.0  13.0000
362  female  45.0  14.4542

In [9]:
simple_random_df=df.sample(n=n_sample,random_state=33)
simple_random_df

        sex   age      fare
297  female   2.0  151.5500
71   female  16.0   46.9000
631    male  51.0    7.0542
567  female  29.0   21.0750
21     male  34.0   13.0000
187    male  45.0   26.5500
607    male  27.0   30.5000
437  female  24.0   18.7500
686    male  14.0   39.6875
417  female  18.0   13.0000

Systematic Sampling:

. Introduces the structure by selecting items at fixed intervals.
. May fail if the data has periodic patterns.

In [10]:
# suffle and slice in the steps of n

n_step=20

shuffled_df=df.sample(frac=1,random_state=80).reset_index(drop=True)

In [11]:
shuffled_df

        sex   age     fare
0      male  51.0  61.3792
1      male   NaN   7.7500
2    female  30.0  56.9292
3      male  36.0  24.1500
4      male  52.0  30.5000
..      ...   ...      ...
886    male  43.0   6.4500
887    male   NaN   7.2250
888  female  35.0  21.0000
889    male  40.0  15.5000
890    male  18.0   7.8542

[891 rows x 3 columns]

In [12]:
systematic_slicing=shuffled_df[::n_step]
systematic_slicing

        sex   age      fare
0      male  51.0   61.3792
20     male   NaN    0.0000
40   female  50.0   28.7125
60     male  29.0   30.0000
80   female  47.0   52.5542
100  female   NaN    7.7333
120    male  21.0   73.5000
140    male   NaN  227.5250
160    male  32.5   30.0708
180    male  59.0    7.2500
200  female  31.0  164.8667
220  female  30.0   86.5000
240    male   NaN   69.5500
260  female  26.0   78.8500
280  female  16.0   86.5000
300    male  48.0    7.8542
320    male  23.0    7.8542
340    male   NaN  221.7792
360  female  53.0   51.4792
380    male  24.5    8.0500
400    male  47.0   15.0000
420    male   NaN    7.7500
440  female  26.0    7.9250
460    male  21.0    8.0500
480    male   3.0   26.0000
500    male  33.0    5.0000
520    male   NaN    7.7500
540    male  56.0   30.6958
560    male  19.0   36.7500
580    male  45.0   26.5500
600  female   1.0   15.7417
620    male  27.0    7.8958
640  female  36.0  120.0000
660  female  41.0   19.5000
680  female   9.0   27.9000
700    male  46.0   26.0000
720    male  23.0   10.5000
740    male   NaN    7.7750
760  female  40.0  134.5000
780    male   NaN    0.0000
800    male  19.0    8.0500
820    male   NaN   39.6000
840    male  21.0   77.2875
860  female  25.0   26.0000
880    male   NaN   23.4500


Stratified Sampling.

· Gurantees subgroup representation (e.g. equal sampling from Male and female groups)
. More complex to implement but useful when population has distinct subgroups.

# group by strata (sex) and perform simple random sampling

In [13]:


strata="sex"

stratified_sample=df.groupby(strata,group_keys=False).apply(lambda x:x.sample(n=5,random_state=42))

C:\Users\karth\AppData\Local\Temp\ipykernel_17568\2396931328.py:3: FutureWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  stratified_sample=df.groupby(strata,group_keys=False).apply(lambda x:x.sample(n=5,random_state=42))

In [14]:
stratified_sample

        sex   age      fare
356  female  22.0   55.0000
79   female  30.0   12.4750
596  female   NaN   33.0000
161  female  40.0   15.7500
716  female  38.0  227.5250
181    male   NaN   15.0500
624    male  21.0   16.1000
794    male  25.0    7.8958
158    male   NaN    8.6625
685    male  25.0   41.5792

Convinience Sample:

· values are selected without randomization.
. may lead to sampling bias and limits generalizability of result.

# display first few rows of the dataset.

In [15]:
df.head(10)

      sex   age     fare
0    male  22.0   7.2500
1  female  38.0  71.2833
2  female  26.0   7.9250
3  female  35.0  53.1000
4    male  35.0   8.0500
5    male   NaN   8.4583
6    male  54.0  51.8625
7    male   2.0  21.0750
8  female  27.0  11.1333
9  female  14.0  30.0708

Clustered Sampling:

- Population is divided into non-overplapping clusters.
- Some clusters are randomly selected
- Either all individuals in seleted cluster are surveyed (one-stage) or sample is take from each selected cluster (two-stage)

In [16]:
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [17]:
clusters=titanic['class'].unique()

In [18]:
 # step2: randomly select 1 cluster (day)
np.random.seed(43)
select_cluster=np. random.choice(clusters,size=1)
select_cluster

# select all data from that cluster.

cluster_sample=titanic[titanic["class"].isin(select_cluster)] 
cluster_sample

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
884,0,3,male,25.0,0,0,7.0500,S,Third,man,True,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True